Revit 2026 API

# UIControlledApplicationTransferringProjectStandards Event

---

Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<TransferringProjectStandardsEventArgs> TransferringProjectStandards
```
```vb
Public Event TransferringProjectStandards As EventHandler(Of TransferringProjectStandardsEventArgs)
```
```cpp
public:
 event EventHandler<TransferringProjectStandardsEventArgs^>^ TransferringProjectStandards {
	void add (EventHandler<TransferringProjectStandardsEventArgs^>^ value);
	void remove (EventHandler<TransferringProjectStandardsEventArgs^>^ value);
}
```
```fsharp
member TransferringProjectStandards : IEvent<EventHandler<TransferringProjectStandardsEventArgs>,
    TransferringProjectStandardsEventArgs>
```

#### Value

EventHandlerTransferringProjectStandardsEventArgs

This event allows an external application to add additional items to the possible list of items to be transferred. These items will be visible and selectable in the Transfer Project Standards dialog box. By default, new items added in this manner will be enabled for transfer. During the scope of this event, modification is not permitted to either the source or target documents. And this event is not cancellable.

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace